IdeaRS.OpenModel.ConnectionSetup
ConnectionSetup

IdeaRS.OpenModel.ConnectionSetup.#ctor
Constructor

IdeaRS.OpenModel.ConnectionSetup.SteelSetup
Steel Setup

IdeaRS.OpenModel.ConnectionSetup.StopAtLimitStrain
Stop analysis when the limit strain is reached.

IdeaRS.OpenModel.ConnectionSetup.WeldEvaluationData
Method of evaluation of stress in welds

IdeaRS.OpenModel.ConnectionSetup.CheckDetailing
Perform check of bolt positions

IdeaRS.OpenModel.ConnectionSetup.ApplyConeBreakoutCheck
Apply cone breakout check

IdeaRS.OpenModel.ConnectionSetup.PretensionForceFpc
Pretension force fpc = k * fub * As

IdeaRS.OpenModel.ConnectionSetup.GammaInst
Partial safety factor of instalation safety

IdeaRS.OpenModel.ConnectionSetup.GammaM3
Preloaded bolts safety factor

IdeaRS.OpenModel.ConnectionSetup.AnchorLengthForStiffness
Length of anchor to define the anchor stiffness in analysis model, as a multiple of anchor diameter (E A /n * [d])

IdeaRS.OpenModel.ConnectionSetup.JointBetaFactor
Joint coefficient βj - Used for Fjd calculation

IdeaRS.OpenModel.ConnectionSetup.EffectiveAreaStressCoeff
Effective area is taken from intersection of stress area and area of joined items according to EN1993-1-8 art. 6.2.5

IdeaRS.OpenModel.ConnectionSetup.FrictionCoefficient
Coefficient of friction between base plate and concrete block

IdeaRS.OpenModel.ConnectionSetup.LimitPlasticStrain
Limit of plastic strain used in 2D plate element check

IdeaRS.OpenModel.ConnectionSetup.WarnPlasticStrain
Warning plastic strain

IdeaRS.OpenModel.ConnectionSetup.WarnCheckLevel
Warning check level

IdeaRS.OpenModel.ConnectionSetup.OptimalCheckLevel
Optimal check level

IdeaRS.OpenModel.ConnectionSetup.DistanceBetweenBolts
Limit distance between bolts as a multiple of bolt diameter

IdeaRS.OpenModel.ConnectionSetup.DistanceBetweenBoltsEdge
Limit distance between bolt and plate edge as a multiple of bolt diameter

IdeaRS.OpenModel.ConnectionSetup.BearingAngle
Load distribution angle of concrete block in calculation of factor Kj

IdeaRS.OpenModel.ConnectionSetup.DecreasingFtrd
Decreasing Ftrd of anchors. Worse quality influence

IdeaRS.OpenModel.ConnectionSetup.BracedSystem
Consider the frame system as braced for stiffness calculation. Braced system reduces horizontal displacements.

IdeaRS.OpenModel.ConnectionSetup.BearingCheck
Apply bearing check including αb

IdeaRS.OpenModel.ConnectionSetup.ApplyBetapInfluence
Apply βp influence in bolt shear resistance. ΕΝ 1993-1-8 chapter 3.6.1 (12)

IdeaRS.OpenModel.ConnectionSetup.MemberLengthRatio
A multiple of cross-section height to determine the default length of member

IdeaRS.OpenModel.ConnectionSetup.DivisionOfSurfaceOfCHS
Number of straight lines to substitute circle of circular tube in analysis model

IdeaRS.OpenModel.ConnectionSetup.DivisionOfArcsOfRHS
Number of straight lines to substitute corner arc of rectangular tubes in analysis model

IdeaRS.OpenModel.ConnectionSetup.NumElement
Ratio of length of decisive plate edge and Elements on edge count determines the average size of mesh element

IdeaRS.OpenModel.ConnectionSetup.NumberIterations
More iterations helps to find better solutions in contact elements but increases calculation time

IdeaRS.OpenModel.ConnectionSetup.Mdiv
Number of iteration steps to evaluate analysis divergence

IdeaRS.OpenModel.ConnectionSetup.MinSize
Minimal size of generated finite mesh element

IdeaRS.OpenModel.ConnectionSetup.MaxSize
Maximal size of generated finite mesh element